Управление_торговлей.ПБТ/src/DataProcessors/вт_ДиаграммаГантаПоПроцессам/вт_ДиаграммаГантаПоПроцессам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>вт_ДиаграммаГантаПоПроцессам</name>
  <attributes>
    <name>ПланЗаказ</name>
    <type>
      <types>DocumentRef.вт_ЗаказВПроизводство</types>
      <types>DocumentRef.вт_ПланПроизводства</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Управление_торговлей.ПБТ/src/InformationRegisters/вт_ГрафикВыполненияПроизводства/вт_ГрафикВыполненияПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>вт_ГрафикВыполненияПроизводства</name>
  <resources>
    <name>Выполнено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбрабатываетсяРегламентнымЗаданием</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.вт_ЗаказВПроизводство</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.вт_ЗаказВПроизводство</types>
      <types>DocumentRef.вт_ПланПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <comment>Производимая продукция, если операция запланирована в разрезе готовой продукции</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Операция</name>
    <comment>Выполняемая операция</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтчетПроизводства</name>
    <type>
      <types>DocumentRef.вт_ОтчетПроизводства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_торговлей.ПБТ/src/DataProcessors/вт_ДиаграммаГантаПоПроцессам/Forms/Форма/Module.bsl
&НаСервере
Процедура КомандаЗаполнитьНаСервере()
	ДиаграммаГанта = РеквизитДГ;
	ДиаграммаГанта.Точки.Очистить();
	ДиаграммаГанта.Серии.Очистить();
	//
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	вт_ГрафикВыполненияПроизводства.ДокументОснование КАК ДокументОснование,
	                      |	вт_ГрафикВыполненияПроизводства.ДатаНачала КАК ДатаНачала,
	                      |	вт_ГрафикВыполненияПроизводства.ДатаОкончания КАК ДатаОкончания,
	                      |	вт_ГрафикВыполненияПроизводства.Номенклатура КАК Номенклатура,
	                      |	вт_ГрафикВыполненияПроизводства.Операция КАК Операция
	                      |ИЗ
	                      |	РегистрСведений.вт_ГрафикВыполненияПроизводства КАК вт_ГрафикВыполненияПроизводства
	                      |ГДЕ
	                      |	вт_ГрафикВыполненияПроизводства.Выполнено = ЛОЖЬ
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ДатаНачала,
	                      |	ДатаОкончания
	                      |ИТОГИ ПО
	                      |	ДокументОснование,
	                      |	Номенклатура,
	                      |	Операция");
	
	ВыборкаПоЗаказам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоЗаказам.Следующий() Цикл
			//Под заказ
			ТочкаПодразделения = ДиаграммаГанта.УстановитьТочку(ВыборкаПоЗаказам.ДокументОснование) ;//("Подразделение1");

			Выборкатовары =  ВыборкаПоЗаказам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока Выборкатовары.Следующий() Цикл
				//Под товар
				Точка = ТочкаПодразделения.Точки.Добавить();
				Точка.Текст = Выборкатовары.Номенклатура; // "Сотрудник1";//устанавливаем заголовок, а еще можно цвет фона, шрифт, цвет текста

				ВыборкаОперации = Выборкатовары.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаОперации.Следующий() Цикл
					Серия = ДиаграммаГанта.УстановитьСерию(ВыборкаОперации.Операция);
					//у каждой точки может быть несколько серий (графиков)
					//у серии можно задать цвет, но это происходит и автоматически
					Выборка =  ВыборкаОперации.Выбрать();
					Пока Выборка.Следующий() Цикл
						Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
						
						//также несколько интервалов
						//По количеству операций
						Интервал = Значение.Добавить();
						Интервал.Начало = Выборка.ДатаНачала;
						Интервал.Конец = Выборка.ДатаОкончания;				
						
					КонецЦикла;	
				КонецЦикла;	
				
				
			КонецЦикла;	

			
		
	КонецЦикла;	
	
	
	//вложенная точка
	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	КомандаЗаполнитьНаСервере();
КонецПроцедуры
